{
  "nav": {
    "1": "Profile",
    "2": "Skills",
    "3": "My project",
    "4": "My history"
  },
  "about": {
    "titre": "Student at IUT-Montpellier in informatic division",
    "table": {
      "1": "Age",
      "2": "Email",
      "3": "Adress",
      "4": "Phone"
    },
    "titre2": "About me",
    "text": "blablabla"
  },
  "detail": {
    "titre": "Details",
    "d1": {
      "titre": "Age",
      "value": 19
    },
    "d2": {
      "titre": "Address",
      "value": "7 avenue Saint Lazare, 34000 Montpellier"
    }
  },
  "tab" : {
    "e1": {
      "titre": "High school's project",
      "text": {
        "1": "During the last year of high school, I learned Python (whose Tkinter)\nI do a lot of software and game whose Pac-Man, Tetris, Sudoku, Space invader, RPG, Calculator, AI (low), Battleship,..."
      }
    },
    "e2": {
      "titre": "RPG",
      "text": {
        "1": "The RPG has been always a game that I enjoyed because it asks me a lot of knowledge and it permit me to resume all of my knowledge in one game.\n I made a dozen (in Python, C++ and Java), below an exemple with a system of world(many map that can be accessed by door), edge detection, harvest, inventory (interactive), charactere class, money, food and life."
      }
    },
    "e3": {
      "titre": "tuLoues.fr",
      "text": {
        "1": ""
      }
    },
    "e4": {
      "titre": "L'awalé",
      "text": {
        "1": "During the third semester of DUT, in teams we had to code a project in the language we wanted. Our project was the awale and we coded it in HTML, CSS, JS.\nIt was in multiplayer (2 computer connected in local) and respected the rules of classic game."
      }
    },
    "e5": {
      "titre": "E-commerce website",
      "text": {
        "1": "Au cours du semestre 3 du DUT, en équipe nous devions coder un site d'e-Commerce en HTML, CSS, PHP avec le modele MVC. Notre theme était un magasin de sport (iDecat).\nIl y avait un panier auquel on pouvait ajouter des produits puis on pouvait payer (pas vraiment car il n'y a pas de vrai produit), une page de connexion et d'inscription pour pouvoir voir son historique d'achat, une base de donnée au model CRUD, un panneau d'administration permettant de créer, modifier, supprimer des produits, clients et commandes.\nLes mots de passe étaient hachés et un mail était envoyé pour confirmer l'inscription."
      }
    },
    "e6": {
      "titre": "IHM",
      "text": {
        "1": "En IHM, nous devions faire un CV en ligne en utilisant Materialize.\nCe fut la v1.0 de ce site."
      }
    }
  },
  "annee": {
    "2019": {
      "BDE": "A la fin de ma première année du DUT informatique, je suis rentré dans le BDE en tant qu'organisateur événementiel",
      "Votre Transport": "Dans le but d'acquérir une expérience du monde du travail, j'ai travaillé en tant que livreur pour la société votre Transport"
    },
    "2018":  {
      "BAC": "A l'issue de ma terminale, j'ai passé l'épreuve du baccalauréat scientifique spécialité ISN, que j'ai obtenu avec mention bien",
      "Votre Transport": "Création d'un site vitrine pour la société Votre Transport.\nCe dernier permettait de voir les informations de l'entreprise et de prendre contact avec celle-ci, le tout était connecté à une base de donnée et un admin panel permettait de modifier le site",
      "IUT": "Entré a l'IUT en section informatique.\nDurant les 2 années passée a l'IUT j'ai participé a la vie commune du campus avec les Journées Porte Ouvertes (renseigné les futurs étudiants), l’English Day (en tant que cuisinier de gâteau et la vente mais aussi participant aux diverses activités) et Nuit de l'info (concours informatique national se déroulant chaque année)"
    },
    "2017":  {
      "Lycée": "Réalisation de divers projets (voir rubrique Mes projets)",
      "ASSOS3034": "Réalisation d'un site d'e-commerce avec Prestashop pour ASSOS3034 dans le but d'une billetterie en ligne pour les membres."
    }
  },
  "darkmode": "Dark mode",
  "flag": ["fr", "en"],
  "langtext": "Language : "
}