{
  "nav": {
    "1": "Profile",
    "2": "Skills",
    "3": "My project",
    "4": "My history",
    "5": "Try"
  },
  "about": {
    "name": "Hi, I'm ",
    "titre": "Student at IUT-Montpellier in informatic division",
    "titre2": "About me",
    "text": "Full-stack developer, I have been passionate about the world of IT for 15 years. Self-taught, I trained using the internet independently. I experience all the languages I know every day, from low-level languages to high-level languages. <br> I don't really have a future project, but one area that I am passionate about is working for medicine."
  },
  "detail": {
    "titre": "Details",
    "d1": {
      "titre": "Age:",
      "value": "ans"
    },
    "d2": {
      "titre": "Email:",
      "value": "<a href='mailto:samuelcasasdray@gmail.com'>samuelcasasdray@gmail.com</a>"
    },
    "d3": {
      "titre": "Adress:",
      "value": "7 avenue Saint Lazare,<br>34000 Montpellier"
    },
    "d4": {
      "titre": "Phone:",
      "value": "07.60.42.87.27"
    }
  },
  "tab" : {
    "e1": {
      "titre": "High school's project",
      "text": {
        "1": "During the last year of high school, I learned Python (whose Tkinter)",
        "2": "I do a lot of software and game whose Pac-Man, Tetris, Sudoku, Space invader, RPG, Calculator, AI (low), Battleship,..."
      },
      "image": {
        "class": "i-2spe",
        "list": {
          "1": {
            "src": "ressources/pacman.PNG",
            "alt": "pacman"
          },
          "2": {
            "src": "ressources/tetris.PNG",
            "alt": "tetris"
          }
        }
      }
    },
    "e2": {
      "titre": "RPG",
      "text": {
        "1": "The RPG has been always a game that I enjoyed because it asks me a lot of knowledge and it permit me to resume all of my knowledge in one game.\n I made a dozen (in Python, C++ and Java), below an exemple with a system of world(many map that can be accessed by door), edge detection, harvest, inventory (interactive), charactere class, money, food and life."
      },
      "image": {
        "class": "i-3",
        "list": {
          "1": {
            "src": "ressources/RPG2.PNG",
            "alt": "rpg1"
          },
          "2": {
            "src": "ressources/RPG3.PNG",
            "alt": "rpg2"
          },
          "3": {
            "src": "ressources/RPG1.PNG",
            "alt": "rpg3"
          }
        }
      }
    },
    "e3": {
      "titre": "Giorgo",
      "text": {
        "1": "In team, we had to realize a website, with a CMS, to show internship offers, with a system account (Student, teacher, business, and other more precise), and with an admin panel"
      },
      "image": {
        "class": "hidden-image",
        "list": {
        }
      }
    },
    "e4": {
      "titre": "L'awalé",
      "text": {
        "1": "During the third semester of DUT, in teams we had to code a project in the language we wanted. Our project was the awale and we coded it in HTML, CSS, JS.\nIt was in multiplayer (2 computer connected in local) and respected the rules of classic game."
      },
      "image": {
        "class": "i-1",
        "list": {
          "1": {
            "src": "ressources/Awale.PNG",
            "alt": "Awale"
          }
        }
      }
    },
    "e5": {
      "titre": "E-commerce website",
      "text": {
        "1": "During the third semester of DUT, in team we had to code an e-Commerce website in HTML, CSS, PHP with MVC model. Our topic was the sport (iDecat).\nTheir was a basket to which you could add product, then you could pay (not really), a login page, a register page and an account page to see his purchase history, a database in CRUD model, a panel admin allow the admin to create, modify, delete products, customer and order.\nPasswords was hashed and a mail was send to confirm the register"
      },
      "image": {
        "class": "i-3",
        "list": {
          "1": {
            "src": "ressources/e-commerce1.PNG",
            "alt": "e-commerce1"
          },
          "2": {
            "src": "ressources/e-commerce2.PNG",
            "alt": "e-commerce2"
          },
          "3": {
            "src": "ressources/e-commerce3.PNG",
            "alt": "e-commerce3"
          }
        }
      }
    },
    "e6": {
      "titre": "IHM",
      "text": {
        "1": "In IHM, we had to do an online CV with Materialize.\nIt was the v1.0 of this website."
      },
      "image": {
        "class": "hidden-image",
        "list": {
        }
      }
    },
    "e7": {
      "titre": "Project Test & validation",
      "text": {
        "1": "For the semester 4 project, our mission was to create a multitude of tests, for the back-end and front-end.",
        "2": "The goal was to find any bugs or errors there could be.",
        "3": "This allowed us to see the importance of the tests."
      },
      "image": {
        "class": "i-2spe",
        "list": {
          "1": {
            "src": "ressources/emulateur.PNG",
            "alt": "emulateur"
          },
          "2": {
            "src": "ressources/test.PNG",
            "alt": "test"
          }
        }
      }
    }
  },
  "annee": {
    "2019": {
      "BDE": "A la fin de ma première année du DUT informatique, je suis rentré dans le BDE en tant qu'organisateur événementiel",
      "Votre Transport": "Dans le but d'acquérir une expérience du monde du travail, j'ai travaillé en tant que livreur pour la société votre Transport"
    },
    "2018":  {
      "BAC": "A l'issue de ma terminale, j'ai passé l'épreuve du baccalauréat scientifique spécialité ISN, que j'ai obtenu avec mention bien",
      "Votre Transport": "Création d'un site vitrine pour la société Votre Transport.\nCe dernier permettait de voir les informations de l'entreprise et de prendre contact avec celle-ci, le tout était connecté à une base de donnée et un admin panel permettait de modifier le site",
      "IUT": "Entré a l'IUT en section informatique.\nDurant les 2 années passée a l'IUT j'ai participé a la vie commune du campus avec les Journées Porte Ouvertes (renseigné les futurs étudiants), l’English Day (en tant que cuisinier de gâteau et la vente mais aussi participant aux diverses activités) et Nuit de l'info (concours informatique national se déroulant chaque année)"
    },
    "2017":  {
      "Lycée": "Réalisation de divers projets (voir rubrique Mes projets)",
      "ASSOS3034": "Réalisation d'un site d'e-commerce avec Prestashop pour ASSOS3034 dans le but d'une billetterie en ligne pour les membres."
    }
  },
  "try" : {
    "app" : {
      "taquin": "game/taquin",
      "sokoban": "game/sokoban"
    },
    "text": "Cliquez sur un lien pour acceder acceder a la version en ligne de l'application"
  }
}