{
  "nav": {
    "1": "Profil",
    "2": "Compétences",
    "3": "Mes projets",
    "4": "Historique",
    "5": "Tester"
  },
  "about": {
    "name": "Bonjour, je suis ",
    "titre": "Étudiant a l'IUT de Montpellier en informatique",
    "titre2": "A propos de moi",
    "text": "Développeur full-stack, je me passionne pour le monde de l'informatique depuis mes 15 ans. Autodidacte, je me suis formé a l'aide d'internet en autonomie. J'expérimente tous les langages que je connais quotidiennement, des langages de bas niveau aux langages de haut niveau.<br>Je n'ai pas réellement de projet futur, mais un domaine qui me passionne serait de travailler pour la médecine."
  },
  "detail": {
    "titre": "Details",
    "d1": {
      "titre": "Age:",
      "value": "ans"
    },
    "d2": {
      "titre": "Adresse mail:",
      "value": "<a href='mailto:samuelcasasdray@gmail.com'>samuelcasasdray@gmail.com</a>"
    },
    "d3": {
      "titre": "Adresse:",
      "value": "7 avenue Saint Lazare,<br>34000 Montpellier"
    },
    "d4": {
      "titre": "Numero de téléphone:",
      "value": "07.60.42.87.27"
    }
  },
  "tab" : {
    "e1": {
      "titre": "Projet du lycée",
      "text": {
        "1": "Durant l'année de terminal au lycée, j'ai appris le Python (dont la lib Tkinter).",
        "2": "J'ai pu durant cette année faire une multitude d'applications et jeu dont un Pac-Man, Tetris, Sudoku, Space invader, RPG, Calculatrice, IA (très faible), Bataille navale,..."
      },
      "image": {
        "class": "i-2spe",
        "list": {
          "1": {
            "src": "ressources/pacman.PNG",
            "alt": "pacman"
          },
          "2": {
            "src": "ressources/tetris.PNG",
            "alt": "tetris"
          }
        }
      }
    },
    "e2": {
      "titre": "Les RPG",
      "text": {
        "1": "Le RPG a toujours été un jeu que j'ai apprécié à coder car il me demandait beaucoup de connaissance et cela me permettait de reprendre l'ensemble de mes connaissances.\n J'en ai fait une dizaine (en python, C++ et java), ci-dessous un exemple de RPG avec un système de monde (plusieurs cartes que l'on peut accéder via des portes), détection des bordures, récolte, inventaire (interactif), classe de personnage, argent, nourriture et vie."
      },
      "image": {
        "class": "i-3",
        "list": {
          "1": {
            "src": "ressources/RPG2.PNG",
            "alt": "rpg1"
          },
          "2": {
            "src": "ressources/RPG3.PNG",
            "alt": "rpg2"
          },
          "3": {
            "src": "ressources/RPG1.PNG",
            "alt": "rpg3"
          }
        }
      }
    },
    "e3": {
      "titre": "Giorgo",
      "text": {
        "1": "En équipe, nous devions réaliser un site web à l'aide d'un CMS, présentant des offres de stages, avec un système de comptes, des droits pour chaque compte, une page d'acceuil, et une page Administrateur."
      },
      "image": {
        "class": "hidden-image",
        "list": {
        }
      }
    },
    "e4": {
      "titre": "L'awalé",
      "text": {
        "1": "Au cours du semestre 3 du DUT, en équipe nous devions coder un projet dans le langage que nous voulions. Notre projet était l'Awalé et nous l'avons codé en HTML, CSS, JS.\nIl était en multijoueur (plusieurs ordinateurs connectés en local) et respectait les règles du jeu classique"
      },
      "image": {
        "class": "i-1",
        "list": {
          "1": {
            "src": "ressources/Awale.PNG",
            "alt": "Awale"
          }
        }
      }
    },
    "e5": {
      "titre": "Site d'e-commerce",
      "text": {
        "1": "Au cours du semestre 3 du DUT, en équipe nous devions coder un site d'e-Commerce en HTML, CSS, PHP avec le modèle MVC. Notre thème était un magasin de sport (iDecat).\nIl y avait un panier auquel on pouvait ajouter des produits puis on pouvait payer (pas vraiment car il n'y a pas de vrai produit), une page de connexion et d'inscription pour pouvoir voir son historique d'achat, une base de donnée au modèle CRUD, un panneau d'administration permettant de créer, modifier, supprimer des produits, clients et commandes.\nLes mots de passe étaient hachés et un mail était envoyé pour confirmer l'inscription."
      },
      "image": {
        "class": "i-3",
        "list": {
          "1": {
            "src": "ressources/e-commerce1.PNG",
            "alt": "e-commerce1"
          },
          "2": {
            "src": "ressources/e-commerce2.PNG",
            "alt": "e-commerce2"
          },
          "3": {
            "src": "ressources/e-commerce3.PNG",
            "alt": "e-commerce3"
          }
        }
      }
    },
    "e6": {
      "titre": "IHM",
      "text": {
        "1": "En IHM, nous devions faire un CV en ligne en utilisant Materialize.\nCe fut la v1.0 de ce site."
      },
      "image": {
        "class": "hidden-image",
        "list": {
        }
      }
    },
    "e7": {
      "titre": "Projet Test & validation",
      "text": {
        "1": "Pour projet du semestre 4, nous avions pour mission de créer une multitude de tests, pour le back-end et front-end.",
        "2": "L'objectif était de trouver tous les bugs ou erreur qu'il pouvait y avoir",
        "3": "Cela nous a permis de voir l'importance des test"
      },
      "image": {
        "class": "i-2spe",
        "list": {
          "1": {
            "src": "ressources/emulateur.PNG",
            "alt": "emulateur"
          },
          "2": {
            "src": "ressources/test.PNG",
            "alt": "test"
          }
        }
      }
    }
  },
  "annee": {
    "2019": {
      "BDE": "A la fin de ma première année du DUT informatique, je suis rentré dans le BDE en tant qu'organisateur événementiel",
      "Votre Transport": "Dans le but d'acquérir une expérience du monde du travail, j'ai travaillé en tant que livreur pour la société votre Transport"
    },
    "2018":  {
      "BAC": "A l'issue de ma terminale, j'ai passé l'épreuve du baccalauréat scientifique spécialité ISN, que j'ai obtenu avec mention bien",
      "Votre Transport": "Création d'un site vitrine pour la société Votre Transport.\nCe dernier permettait de voir les informations de l'entreprise et de prendre contact avec celle-ci, le tout était connecté à une base de donnée et un admin panel permettait de modifier le site",
      "IUT": "Entré a l'IUT en section informatique.\nDurant les 2 années passée a l'IUT j'ai participé a la vie commune du campus avec les Journées Porte Ouvertes (renseigné les futurs étudiants), l’English Day (en tant que cuisinier de gâteau et la vente mais aussi participant aux diverses activités) et Nuit de l'info (concours informatique national se déroulant chaque année)"
    },
    "2017":  {
      "Lycée": "Réalisation de divers projets (voir rubrique Mes projets)",
      "ASSOS3034": "Réalisation d'un site d'e-commerce avec Prestashop pour ASSOS3034 dans le but d'une billetterie en ligne pour les membres."
    }
  },
  "try" : {
    "app" : {
      "taquin": "game/taquin",
      "sokoban": "game/sokoban"
    },
    "text": "Cliquez sur un lien pour acceder acceder a la version en ligne de l'application"
  }
}
